#ifndef TICKET
#define TICKET
class Ticket
{
private:
    char *sPoint;
    char *ePoint;
    char time[11];
    double price;
    int flightSeat;
    int duration;
    bool businessClass;

    void copy(Ticket& ticket);
    void erase();
public:
    char *getSPoint();

    void setSPoint(char *sPoint);

    char *getEPoint();

    void setEPoint(char *ePoint);

    char getTime(char time[]);

    void setTime(char time[11]);

    double getPrice();

    void setPrice(double price);

    int getFlightSeat();

    void setFlightSeat(int flightSeat);

    int getDuration();

    void setDuration(int duration);

    bool isBusinessClass();

    void setBusinessClass(bool businessClass);
    ~Ticket();
    Ticket();
    Ticket(char *sPoint,
    char *ePoint,
    char time[11],
    double price,
    int flightSeat,
    int duration,
    bool businessClass);
    Ticket& operator=(Ticket& ticket);
};
#endif 


// Един самолетен билет има следните атрибути:
// 	-> начална точка
// 	-> крайна точка(дестинация)
// 	-> дата (текст в следния формат: "dd-mm-yyyy")
// 	-> цена
// 	-> място в самолета
// 	-> класа(бизнес или икономична)
// 	-> продължителност (цяло число в минути)
// 	Функционалностите, които трябва да предоставя вашият клас са следните:
// 	-> достъп до всички атрибути на класа (през т.н. get методи)
// 	-> смяна на датата - необходими са три параметъра - новата дата, новата цена на билета(тя
// 	се променя според датите) и новата класа на билета
// 	-> принтиране на билет
// 	Реализирайте програма, която с помощта на вече дефинирания клас предоставя следната
// 	функционалност:
// 	-> въвеждане на самолетни билети
// 	-> функция, която отпечатва в конзолата всички билети, които имат конкретна начална
// 	точка (подадена като параметър)
// 	-> функция, която отпечатва в конзолата всички билети, които имат конкретна дестинация
// 	и дата (подадени като параметри)
// 	-> функция, която извежда информация колко човека пристигат в конкретен ден във всяка
// 	дестинация (денят се подава като параметър)
// 	-> функция, която пресмята средната цена на билетите за всеки полет (един полет се
// 	определя по начална дестинация, крайна дестинация и дата)
// 	Реализирайте клас Person със следните атрибути:
// 	-> три имена
// 	-> ЕГН
// 	-> възраст Във всеки билет добавете информация за човека, който го е закупил.
// 	Реализирайте следната функционалност:
// 	-> смяна на притежанието на билет - за всеки билет трябва да може да бъде сменен човека,
// 	който ще пътува, без това да се отразява на останалите атрибути на билета
// 	-> функция, която за всеки полет пресмята колко деца под 12 годишна възраст ще летят с
// 	него
// 	-> функция, която по подадено първо име пресмята колко човека с това име имат закупен
// 	билет за конкретна дата